{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"cd345c4e-2a7a-5384-b854-4135b1376c48","excerpt":"Apple Watch Glances As an avid listener of podcasts one of my biggest bugbears is the steps that I have to go \nthrough in order to skip a podcast backwards to…","html":"<p><img src=\"%7B%7B%20site.baseurl%20%7D%7D/images/now-playing-apple-podcast-app.png\" alt=\"alt text \" title=\"Apple Watch at a Glance\"></p>\n<h1>Apple Watch Glances</h1>\n<p>As an avid listener of podcasts one of my biggest bugbears is the steps that I have to go\nthrough in order to skip a podcast backwards to listen again to a segment that I missed, or\nto skip past some intro music / advert that I have heard for the nth time.</p>\n<p>It normally goes:</p>\n<ol>\n<li>Interuption / what was that just said?</li>\n<li>Take phone out of pocket / pick up phone</li>\n<li>Wake up phone</li>\n<li>Skip forward or backward on lock screen</li>\n</ol>\n<p>Not very many steps you may think, but fetching the phone out of my pocket when mowing the\nlawn or walking the dog gets irritating especially when you have to stop to fish it out. </p>\n<p><img src=\"%7B%7B%20site.baseurl%20%7D%7D/images/pebble.jpg\" alt=\"alt text \" title=\"Pebble Watch\"></p>\n<h2>Pebble Watch</h2>\n<p>I have owned a smart watch in the form of a Pebble Watch from the first iteration that I\nbacked on kickstarter. An it has served me well for nearly three years. The notification\ndisplay coupled with the ability to accept or cancel an incoming phone call on the watch\ncame to be features that I have rely on.</p>\n<p>The feature that proved to be the most useful was the ability to control music and podcast\nplayback on the watch. Pebble watches provided an interface to control volume, pause and\nplay, fast forward/rewind to the next song or podcast. This was achieved via the three\nbuttons on the right where you could alternate the functionality of the top and bottom\nbuttons by pressing the middle button to toggle between volume and fast forward/rewind modes.</p>\n<p>After a while it became apparent that there\nwas a UX design flaw in the toggle functionality as there was no audible cue to which mode\nyou were in and this lead to frustratingly fast forwarding to the end of the current podcast\nrather than adjusting volume.</p>\n<p><img src=\"%7B%7B%20site.baseurl%20%7D%7D/images/pebble-screen-tearing.jpg\" alt=\"alt text \" title=\"Pebble Watch Screen Tearing\"></p>\n<p>The bad UX I could live with, but when the Pebble started screen tearing I began to\nentertain the possiblity of purchasing an Apple watch.</p>\n<h2>Apple Watch no official podcast app</h2>\n<p>When I started considering an Apple watch to replace my Pebble watch I searched for reviews of\nApple’s podcast watch app and found out there was not an official app available. The good\nnews was that other podcast app players such as Overcast did provide companion watch apps\nthat allowed skipping. </p>\n<p><img src=\"%7B%7B%20site.baseurl%20%7D%7D/images/overcast-apple-watch-app.png\" alt=\"alt text \" title=\"Overcast Apple Watch App\"></p>\n<p>Although due to the amount of time I had spent curating the content of Apple’s podcast player and\ngeneral inertia I was not keen on switching, but if that was the only way to gain the skip\nfunctionality I would if needed.  </p>\n<h2>Swipe up to glance at now playing</h2>\n<p>The Apple watch allows companion apps to implement a glance interface on the watch which is\naccessed by swiping up on the watch face screen. Glances are quick summaries of\ninformation provided by the apps that you select to appear in the glances menu.</p>\n<p>While exploring the glances functionality of the Apple watch I came across the now playing\nglance that gave a hint that it could control podcast playback without the need for a\ndedicated watch app.</p>\n<h3>Now playing glance</h3>\n<p><img src=\"%7B%7B%20site.baseurl%20%7D%7D/images/now-playing-not-playing.png\" alt=\"alt text \" title=\"Apple Watch now playing glance\"></p>\n<p>I started a podcast to investigate would the now playing glance expose the skip functionality?,\nto my delight it did. Also it allowed the adjusting of volume through the on screen\ntouch enabled plus and minus buttons as well as via the digital crown.</p>\n<h3>Apple Podcast now playing glance</h3>\n<p><img src=\"%7B%7B%20site.baseurl%20%7D%7D/images/now-playing-apple-podcast-app.png\" alt=\"alt text \" title=\"Apple Watch now playing a podcast now playing glance\"></p>\n<h3>Overcast Podcast now playing glance</h3>\n<p>The same now playing information summary is also available for the Overcast App, which puts it\non an even footing with the other official and third party music and podcast players.</p>\n<p><img src=\"%7B%7B%20site.baseurl%20%7D%7D/images/now-playing-overcast-app.png\" alt=\"alt text \" title=\"Apple Watch now playing an Overcast podcast now playing glance\"></p>\n<h2>Apple watch podcast now playing glance pros and cons</h2>\n<h3>Podcast glance pros</h3>\n<p>Skip forward and back functionality. </p>\n<p>Easily accessed thorough the swipe up gesture. </p>\n<p>Changing of volume through on screen touch enabled plus and minus buttons. </p>\n<p>Ability to change volume via the digital crown. </p>\n<h3>Podcast glance drawbacks</h3>\n<p>No indication of how long is left of the podcast.</p>","frontmatter":{"title":"The Apple Watch at a Glance","date":null}}},"pageContext":{"slug":"/2016-5-29-the-apple-watch-at-a-glance/2016-5-29-the-apple-watch-at-a-glance/","previous":{"fields":{"slug":"/2016-7-14-es6-string-template-literals/2016-7-14-es6-string-template-literals/"},"frontmatter":{"title":"ES6 String Template Literals"}},"next":{"fields":{"slug":"/2016-5-9-windows-deleting-node-modules/2016-5-9-windows-deleting-node-modules/"},"frontmatter":{"title":"Deleting a node_modules folder on windows without downloading anything"}}}}