{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog"}},"allMarkdownRemark":{"edges":[{"node":{"excerpt":"How to test Array equality When testing arrays with QUnit you may wish to assert that one array is equal to another array. Qunit provides the equal( actual, expected, message ) method for asserting that actual value is equal to the expected value. so what happens in the following test scenario this… It fails horribly onscreen with an error from the…","fields":{"slug":"/2014-4-4-unit-testing-arrays-with-qunit/2014-4-4-unit-testing-arrays-with-qunit/"},"frontmatter":{"date":null,"title":"Unit Testing arrays with QUnit"}}},{"node":{"excerpt":"If you ever wanted to Monkey Patch Javascript here’s how… Step 1. Pop open your javascript console, alt+cmd+i (mac) / ctrl_shift+i (pc) for dev tools then select the console tab. Step 2. Let’s monkey path console.log to use a function that alerts instead. Type console.log = function(message) { alert(message) }; and hit return Step 3. Now let’s use our monkey…","fields":{"slug":"/2015-2-7-psst-wanna-monkey-patch/2015-2-7-psst-wanna-monkey-patch/"},"frontmatter":{"date":null,"title":"Psst! Wanna Monkey Patch?"}}},{"node":{"excerpt":"One of the great things about angular is it’s testability. Say we have a directive that uses geolocation to display this information to the user if it is available\nand to display a message if it is not available. So how can we test it using Jasmine and ensure that our test will work regardless if geolocation is \navailable during our testing? We create a spy…","fields":{"slug":"/2015-2-18-angularjs-jsamine-spies-and-fakes/2015-2-18-angularjs-jsamine-spies-and-fakes/"},"frontmatter":{"date":null,"title":"AngularJS Jasmine Spies and Fakes"}}},{"node":{"excerpt":"Computer languages should give more prominence to their core philosophy like Python The Zen of Python, by Tim Peters, is only one command away {% highlight html %} import this {% endhighlight %} Beautiful is better than ugly. Explicit is better than implicit. Simple is better than complex. Complex is better than complicated. Flat is better than nested…","fields":{"slug":"/2015-2-28-the-zen-of-python/2015-2-28-the-zen-of-python/"},"frontmatter":{"date":null,"title":"The Zen of Python"}}},{"node":{"excerpt":"5 steps to create a simple PHP Server Step 1. Install PHP 5  http://php.net/manual/en/install.php Step 2. On a mac Open up a terminal and type: $ cd Documents/somedir\n$ sudo php -S 127.0.0.1:80 -t . On windows Open up the console and type: c:\\Users\\CurrentFolder>cd \\Users\\somedir\nc:\\Users\\CurrentFolder>php -S 127.0.0.1:80 -t . Step 3. Create a new index.html…","fields":{"slug":"/2015-3-2-so-you-want-a-simple-php-server/2015-3-2-so-you-want-a-simple-php-server/"},"frontmatter":{"date":null,"title":"So you want a simple PHP Server?"}}},{"node":{"excerpt":"AngularJS - it’s directives all the way down data-ng-app The first part of learning AngularJS is nearly always adding the attribute ng-app to your html that auto-bootstraps your AngularJS application. {% highlight html %}\n\t \n{% endhighlight %} or  {% highlight html %}\n\t \n{% endhighlight %} You should of course use the data-* syntax if you want your html to…","fields":{"slug":"/2015-3-23-directives-all-the-way-down/2015-3-23-directives-all-the-way-down/"},"frontmatter":{"date":null,"title":"AngularJS - its turtles all the way down!"}}},{"node":{"excerpt":"Prevent AngularJS displaying curly braces when your page is loading The problem When your AngularJS website is loading if you are using double curly braces within a element to bind to a variable. {% highlight html %}\n\t Hello {{ name }}! \n{% endhighlight %}\n\t\nyour user may for a split second (or longer) be presented with {% raw %}\n\tHello {{}}!\n{% endraw…","fields":{"slug":"/2015-3-31-angularjs-bind/2015-3-31-angularjs-bind/"},"frontmatter":{"date":null,"title":"AngularJS - ngBind - Now you see it - now you don't..."}}},{"node":{"excerpt":"Open for edits Taking inspiration from Phil Haacks  blog  I have added a edit link to my blog posts. Now every post in my blog has an edit link that lets you edit the blog post directly in the browser and automatically sends me a pull request. So if you see any mispelling feel free to correct it and send me a pal request. I have added a Contributors page to…","fields":{"slug":"/2015-4-3-collabocats/2015-4-3-collabocats/"},"frontmatter":{"date":null,"title":"Collabocats"}}},{"node":{"excerpt":"If you would like to test your CSS classes with Jasmine you can use Jasmine Jquery. jasmine-jquery provides two extensions for the  Jasmine  JavaScript Testing Framework: a set of custom matchers for jQuery framework an API for handling HTML, CSS, and JSON fixtures in your specs Using the loadStyleFixtures or setStyleFixtures global shortcuts we can add the…","fields":{"slug":"/2015-4-22-jasmine-jquery-testing-css/2015-4-22-jasmine-jquery-testing-css/"},"frontmatter":{"date":null,"title":"Testing CSS classes with Jasmine-JQuery"}}},{"node":{"excerpt":"5 steps to create a simple Node HTTP Server Step 1. Open a terminal and install NPM if you don’t have it yet {% highlight html %}\ncurl  https://npmjs.org/install.sh  | sh\n{% endhighlight %} Step 2. Install the Node HTTP Server {% highlight html %}\nnpm install http-server -g\n{% endhighlight %} Step 3. Run the Node HTTP Server {% highlight html %}\nhttp-server…","fields":{"slug":"/2015-5-4-so-you-want-a-simple-node-http-server/2015-5-4-so-you-want-a-simple-node-http-server/"},"frontmatter":{"date":null,"title":"So you want a simple Node HTTP Server?"}}},{"node":{"excerpt":"AngularJS has 5 ways to create services Provider - used by the other services except constant Factory - constructs a new service using a function that returns an object Value - for storing simple values or objects Service - works the same a factory except as it is  newed  internally it uses  this  properties Constants - for providing configuration services…","fields":{"slug":"/2015-5-12-angularjs-service-v-factory/2015-5-12-angularjs-service-v-factory/"},"frontmatter":{"date":null,"title":"AngularJS Service versus Factory"}}},{"node":{"excerpt":"Here are my top 10 podcasts for coding Techzing \nJason and Justin present a podcast that has the right mix of coding, tech stories and the projects that they are currently working on. They also sometimes have interviews episodes and on their 100 show they interviewed Jason Calacanis. Dev Hell  Presented by Chris Hartjes and Ed Finkler this podcast has a php…","fields":{"slug":"/2015-7-3-my-top-ten-coding-podcasts/2015-7-3-my-top-ten-coding-podcasts/"},"frontmatter":{"date":null,"title":"My Top Ten Coding Podcasts"}}},{"node":{"excerpt":"Sorting When you have a javascript array that you need to sort you can use the sort method as it is simple to read, use and understand. If you call sort on a simple array of strings or numbers it will sort them alphabetically or numerically. Also, if you pass in an optional anonymous function parameter you can custom sort the array as long as your function…","fields":{"slug":"/2015-7-13-shuffling-a-javascript-array/2015-7-13-shuffling-a-javascript-array/"},"frontmatter":{"date":null,"title":"Shuffle a Javascript Array"}}},{"node":{"excerpt":"What can you do if your karma unit tests are failing or throwing an error? Coding unit tests creates a similar set of problems as programming the code you wish to test. They can throw an error They can throw an exception Unexpectantly failing a test Just plain failing Running karma with phantomjs When running your javascript unit tests having them running as…","fields":{"slug":"/2015-8-4-debugging-phantomjs-tests-in-a-browser/2015-8-4-debugging-phantomjs-tests-in-a-browser/"},"frontmatter":{"date":null,"title":"How to debug phantomjs tests in another browser"}}},{"node":{"excerpt":"Ternary Operators in Angular Templates Ternary Operators are part of the toolset of most programming languages and are available of course in Javascript. The syntax for a ternary operator is {% highlight html %}\ncondition ? expr1 : expr2\n{% endhighlight %} Where the  condition  is any statement that evaluates to true or false and expressions  expr1  and…","fields":{"slug":"/2015-9-22-ternary-operators-in-angular-templates/2015-9-22-ternary-operators-in-angular-templates/"},"frontmatter":{"date":null,"title":"Ternary Operators in Angular Templates"}}},{"node":{"excerpt":"Inspect an element All of the major browsers including, Chrome, Internet Explorer, Firefox, Safari and Opera include in their development tools the ability to\ninspect an element. This allows you to right click on a web page, select “inspect element” from the context menu which will in turn open the \nbrowsers development tools to allow you to view the HTML…","fields":{"slug":"/2015-10-2-debugging-angularjs-$scope-in-a-browser-console/2015-10-2-debugging-angularjs-$scope-in-a-browser-console/"},"frontmatter":{"date":null,"title":"How to debug AngularJS $scope in a browser console"}}},{"node":{"excerpt":"Creating an empty $scope object In AngularJS there are many cases where you will create a $scope object and initialise it as an empty object. A typical case would be when you are going to open a form modal to allow the addition of a new person. {% highlight html %}\nvm.showAddPersonModal = function() {                   \t\n  $scope.person = {};\n  $scope.action…","fields":{"slug":"/2015-11-4-angularjs-empty-$scope-object-check/2015-11-4-angularjs-empty-$scope-object-check/"},"frontmatter":{"date":null,"title":"How to check for an empty AngularJS $scope object"}}},{"node":{"excerpt":"When creating your own custom angularjs directives you may wish to append a value to a variable that is being evaluated within the \nelement that you are attaching your directive to.  If you are using a  link  function to manipulate a vm variable {% highlight html %}\n(function() {\n  angular.module(“app”, []); \n})(); (function() {\n  angular.module(“app…","fields":{"slug":"/2015-11-11-angularjs-execute-a-custom-directive-link-function-after-ngBind-or-interpolation/2015-11-11-angularjs-execute-a-custom-directive-link-function-after-ngBind-or-interpolation/"},"frontmatter":{"date":null,"title":"AngularJS how to execute a custom directive link or compile function after ngBind or interpolation"}}},{"node":{"excerpt":"Simple git workflow When working on my personal projects I have always followed a simple git workflow that involves nothing more \ncomplicated than creating a new branch adding and comitting my changes into the new branch, then merging the \nnew branch into master and pushing it to  bitbucket  or \n github . {% highlight html %}\ngit branch “NewBranch”\n…make…","fields":{"slug":"/2015-12-2-git-add/2015-12-2-git-add/"},"frontmatter":{"date":null,"title":"What exactly does git add -A do?"}}},{"node":{"excerpt":"Using animations to alert the user to value changes When highlighting to the user a change of a value on a page with a noisy layout you are faced with two possibilities, \neither use a colour to highlight the change or add an animation to emphasize the transition \nbetween the initial value and the new value. Using a colour can add to visual noise on page if…","fields":{"slug":"/2016-01-6-creating-an-angularjs-pulse-directive/2016-01-6-creating-an-angularjs-pulse-directive/"},"frontmatter":{"date":null,"title":"Creating an AngularJS pulse directive"}}},{"node":{"excerpt":"A common pattern you will see in AngularJS is angular code being wrapped in a Self Executing Anonymous Function (SEAF) such as a directive  being attached to an angular module. A SEAF is also known as an IIFE which is short for Immediately-Invoked Function Expression. What is a Self Executing Anonymous Function (SEAF)? In order to create modular code in…","fields":{"slug":"/2016-01-16-self-executing-anonymous-function-in-angularjs/2016-01-16-self-executing-anonymous-function-in-angularjs/"},"frontmatter":{"date":null,"title":"Self Executing Anonymous Functions in AngularJS"}}},{"node":{"excerpt":"Kadence - My first app in the Apple iOS App Store First the idea I have found the best way to have an idea for a first app is fulfill a gap\nin the market for app that you have discovered because you  need  that app. This will allow you design the app with the user in mind because user number one\nwill be  you  so unless you are a special unique flower other…","fields":{"slug":"/2016-2-15-theres-an-app-for-that-kadence/2016-2-15-theres-an-app-for-that-kadence/"},"frontmatter":{"date":null,"title":"There's an app for that - Kadence"}}},{"node":{"excerpt":"Spread Operator Angular2 is now in beta and the Angular Team have built it upon Typescript. Typescript is a\ntyped superset of Javascript created and maintained by Microsoft. The usage of types allows the\ncode written in Typescript to have the advantage of compile time checking, code completion and ES6 compatibility. While working through some introductory…","fields":{"slug":"/2016-3-10-typescript-spread-operator/2016-3-10-typescript-spread-operator/"},"frontmatter":{"date":null,"title":"Typescript Spread Operator"}}},{"node":{"excerpt":"Angular2  - Components In Angular2 Components are the way we add behaviour to new DOM elements that we add to an application whereas \nDirectives add behaviour to existing elements. Components allow us to break down an application into smaller \npieces of code that can encapsulate behaviour and functionality. This allows us to test the component \nseparately…","fields":{"slug":"/2016-4-14-angular2-unit-testing-a-component/2016-4-14-angular2-unit-testing-a-component/"},"frontmatter":{"date":null,"title":"Angular2 - Unit Testing a component"}}},{"node":{"excerpt":"Windows and node_modules folders When trying to delete a node _ modules folder within windows explorer you will be presented with a windows dialog saying the ‘The folder contains items whose names are too long for the Recycle Bin.’ This is due to a restriction of the NTFS file system where the MAX_PATH of a complete directory file path cannot be more than…","fields":{"slug":"/2016-5-9-windows-deleting-node-modules/2016-5-9-windows-deleting-node-modules/"},"frontmatter":{"date":null,"title":"Deleting a node_modules folder on windows without downloading anything"}}},{"node":{"excerpt":"Apple Watch Glances As an avid listener of podcasts one of my biggest bugbears is the steps that I have to go \nthrough in order to skip a podcast backwards to listen again to a segment that I missed, or \nto skip past some intro music / advert that I have heard for the nth time. It normally goes: Interuption / what was that just said? Take phone out of pocket…","fields":{"slug":"/2016-5-29-the-apple-watch-at-a-glance/2016-5-29-the-apple-watch-at-a-glance/"},"frontmatter":{"date":null,"title":"The Apple Watch at a Glance"}}},{"node":{"excerpt":"Template Literals ES6 has introduced Template Literals as a new way of working with strings and string \ntemplates. Template Literals have ensured that working with strings will no longer be \nas painful as it once was. The main benefits are: Back ticks - no more escaping Multi-line - now less characters  Interpolation - not only variables but any expressions…","fields":{"slug":"/2016-7-14-es6-string-template-literals/2016-7-14-es6-string-template-literals/"},"frontmatter":{"date":null,"title":"ES6 String Template Literals"}}},{"node":{"excerpt":"In the beginning there was var And  var  was a little bit tricky to understand. So, along came es6 with the new \nshiny  let . Block level scoping In javascript the setting of a variable can be the cause of bugs due to way javascript allows \nthe assigning of values. For example, in the code below you would think that declaring and \nassigning a value to a…","fields":{"slug":"/2016-8-04-es6-let-there-be-let/2016-8-04-es6-let-there-be-let/"},"frontmatter":{"date":null,"title":"ES6 Let there be let"}}},{"node":{"excerpt":"react-random-squares-avatar A simple react component that creates a Slack like avatar. Demo & Examples Live demo:  reactrandomsquaresavatar-demo.firebaseapp.com/ {:target=“_blank”} Github Github repo:\n https://github.com/NicholasMurray/react-random-squares-avatar {:target=“_blank”} NPM NPM Package:\n https://www.npmjs.com/package/react-random-squares-avatar…","fields":{"slug":"/2017-3-18-react-random-squares-avatar/2017-3-18-react-random-squares-avatar/"},"frontmatter":{"date":null,"title":"React Random Squares Avatar"}}},{"node":{"excerpt":"Far far away, behind the word mountains, far from the countries Vokalia and\nConsonantia, there live the blind texts. Separated they live in Bookmarksgrove\nright at the coast of the Semantics, a large language ocean. A small river named\nDuden flows by their place and supplies it with the necessary regelialia. On deer horse aboard tritely yikes and much The…","fields":{"slug":"/hi-folks/"},"frontmatter":{"date":"May 28, 2015","title":"New Beginnings"}}},{"node":{"excerpt":"Wow! I love blogging so much already. Did you know that “despite its name, salted duck eggs can also be made from\nchicken eggs, though the taste and texture will be somewhat different, and the\negg yolk will be less rich.”?\n( Wikipedia Link ) Yeah, I didn’t either.","fields":{"slug":"/my-second-post/"},"frontmatter":{"date":"May 06, 2015","title":"My Second Post!"}}},{"node":{"excerpt":"This is my first post on my new fake blog! How exciting! I’m sure I’ll write a lot more interesting things in the future. Oh, and here’s a great quote from this Wikipedia on\n salted duck eggs . A salted duck egg is a Chinese preserved food product made by soaking duck\neggs in brine, or packing each egg in damp, salted charcoal. In Asian\nsupermarkets, these…","fields":{"slug":"/hello-world/"},"frontmatter":{"date":"May 01, 2015","title":"Hello World"}}},{"node":{"excerpt":"5 steps to create a simple HTTP Server with python Step 1. Install Python 2.7  https://wiki.python.org/moin/BeginnersGuide/Download Step 2. On a mac Open up a terminal and type: $ cd Documents/somedir\n$ python -m SimpleHTTPServer On windows Open up the console and type: c:\\Users\\CurrentFolder>cd \\Users\\somedir\nc:\\Users\\CurrentFolder>python -m…","fields":{"slug":"/2014-3-3-so-you-want-a-simple-httpserver/2014-3-3-so-you-want-a-simple-httpserver/"},"frontmatter":{"date":"March 03, 2014","title":"So you want a simple HTTPServer?"}}}]}},"pageContext":{}}