{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"2887e74e-1104-54be-aa65-1004895a7ec0","excerpt":"Kadence - My first app in the Apple iOS App Store First the idea I have found the best way to have an idea for a first app is fulfill a gap\nin the market for…","html":"<p><img src=\"/images/kadence.png\" alt=\"alt text \" title=\"There&#x27;s an app for that - Kadence\"></p>\n<h1>Kadence - My first app in the Apple iOS App Store</h1>\n<h2>First the idea</h2>\n<p>I have found the best way to have an idea for a first app is fulfill a gap\nin the market for app that you have discovered because you <strong><em>need</em></strong> that app.</p>\n<p>This will allow you design the app with the user in mind because user number one\nwill be <strong><em>you</em></strong> so unless you are a special unique flower other users may find it useful also.</p>\n<p>In my case I required an app that would allow help me decide to choose a new bike based on\nchainset and cassette combinations. I wanted to find a bike that had a range somewhere\nbetween a compact road bike and mountain bike - an all-rounder that would allow me to climb\nsteep climbs but still not spin-out when going down hills.</p>\n<p>My requirements were:</p>\n<ol>\n<li>Ease of adding bikes</li>\n<li>Ease of navigation between bikes</li>\n<li>Mobility</li>\n</ol>\n<p>And that’s why <a href=\"https://itunes.apple.com/us/app/kadence/id1081127512?mt=8\" target=\"_blank\">Kadence</a> was created.</p>\n<h2>How it was built</h2>\n<h3>Ionic</h3>\n<p>The <a href=\"http://ionicframework.com/\" target=\"_blank\">ionic</a> framework “is a powerful HTML5 SDK that helps you build native-feeling mobile apps using web technologies like HTML, CSS, and Javascript.” I have found that it allowed me to create my hybrid HTML5 app using a familiar tool set.</p>\n<h3>AngularJS</h3>\n<p>The <a href=\"https://angularjs.org/\" target=\"_blank\">AngularJS</a> is a Javascript framework that is 100% client-side and compatible with both desktop and mobile browsers. Ionic is built upon Angular directives and components and also uses the Angular UI router for single page apps. Being familiar with AngularJS gave me an easier on-boarding for the ionic framework.</p>\n<h3>PouchDB</h3>\n<p><a href=\"http://pouchdb.com/\" target=\"_blank\">PouchDB</a> “is an open-source JavaScript database inspired by Apache CouchDB that is designed to run well within the browser”. Although it enables applications to store data locally and then synchronize with CouchDB and when the application is back online I only needed the offline capability for my app.</p>\n<h2>Lessons Learned</h2>\n<h3>Refactoring</h3>\n<p>Although you can fall into the refactoring &#x3C;a href=”<a href=\"http://tumblr.jeremyjohnstone.com/post/74379505516/the-code-refactoring-trap\" target=\"_blank\" rel=\"nofollow\">http://tumblr.jeremyjohnstone.com/post/74379505516/the-code-refactoring-trap</a> target=“_blank”>trap</a> when creating your first app I think it’s acceptable if this is your first app and your first effort will be more a prototype rather than the finished article. The more familiar you get with Ionic the easier it will be to envisage and plan how to build your app correctly from the start.</p>\n<h3>Perseverance</h3>\n<p>If like me you are building an app in your spare time you will need a substantial amount of perseverance to see it through. But it will be worth it when you see your app live in the <a href=\"https://itunes.apple.com/gb/app/kadence/id1081127512?mt=8\" target=\"_blank\">app store</a>.</p>","frontmatter":{"title":"There's an app for that - Kadence","date":"February 15, 2016"}}},"pageContext":{"slug":"/2016-2-15-theres-an-app-for-that-kadence/2016-2-15-theres-an-app-for-that-kadence/","previous":{"fields":{"slug":"/2016-3-10-typescript-spread-operator/2016-3-10-typescript-spread-operator/"},"frontmatter":{"title":"Typescript Spread Operator"}},"next":{"fields":{"slug":"/2015-5-4-so-you-want-a-simple-node-http-server/2015-5-4-so-you-want-a-simple-node-http-server/"},"frontmatter":{"title":"So you want a simple Node HTTP Server?"}}}}